Revit 2027 API
RevisionsOnSheetUIServiceData.GetRevitElementIds Method
Note: This API is now obsolete.
 return the list of revit Element Ids
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public IList<ElementId> GetRevitElementIds()
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>
Public Function GetRevitElementIds As IList(Of ElementId)
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
IList<ElementId^>^ GetRevitElementIds()
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>]
member GetRevitElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace